my_list = ['Яковлева Елена', 'Исакова Виктория', 'Боярская Елизавета', 'Ходченкова Светлана', 'Пересильд Юлия', 'Агуреева Полина', 'Раппопорт Ксения', 'Хаматова Чулпан', 'Аронова Мария', 'Лядова Елена', 'Чиповская Аня', 'Мороз Дарья', 'Луговая Мария', 'Снигирь Юлия', 'Толстоганова Виктория', 'Хлынина Юлия', 'Троянова Яна', 'Гладких Яна', 'Дроздова Ольга', 'Голуб Марина']
my_new_list = []
my_new_list_2 = []
my_new_list_3 = []

for i in my_list:
    y = i.split()
    y[0] = y[0] + '+'
    y[1] = y[1] + '+'
    my_new_list.append(y)

for y in my_new_list:
    y[0]=y[0]+y[1]
    y.pop(1)
    my_new_list_2.append(y)

for i in my_new_list_2:
    for x in i:
        my_new_list_3.append(x)
print(my_new_list_3)